; domain
(define (domain emergency-logistics)
  (:requirements :strips :typing)

  (:types
    drone arm location person box content - object
  )

  (:predicates
    (at-drone ?d - drone ?l - location)
    (at-person ?p - person ?l - location)
    (at-box ?c - box ?l - location)

    (arm-of ?a - arm ?d - drone)
    (arm-free ?a - arm)
    (holding ?a - arm ?c - box)

    (box-has ?c - box ?t - content)
    (person-has ?p - person ?t - content)
  )

  (:action fly
    :parameters (?d - drone ?from - location ?to - location)
    :precondition (at-drone ?d ?from)
    :effect (and
      (at-drone ?d ?to)
      (not (at-drone ?d ?from))
    )
  )

  (:action pick
    :parameters (?d - drone ?a - arm ?c - box ?l - location)
    :precondition (and
      (arm-of ?a ?d)
      (arm-free ?a)
      (at-drone ?d ?l)
      (at-box ?c ?l)
    )
    :effect (and
      (holding ?a ?c)
      (not (arm-free ?a))
      (not (at-box ?c ?l))
    )
  )

  (:action drop
    :parameters (?d - drone ?a - arm ?c - box ?l - location)
    :precondition (and
      (arm-of ?a ?d)
      (at-drone ?d ?l)
      (holding ?a ?c)
    )
    :effect (and
      (at-box ?c ?l)
      (arm-free ?a)
      (not (holding ?a ?c))
    )
  )

  (:action deliver
    :parameters (?d - drone ?a - arm ?c - box ?p - person ?l - location ?t - content)
    :precondition (and
      (arm-of ?a ?d)
      (at-drone ?d ?l)
      (at-person ?p ?l)
      (holding ?a ?c)
      (box-has ?c ?t)
    )
    :effect (and
      (person-has ?p ?t)
      (at-box ?c ?l)
      (arm-free ?a)
      (not (holding ?a ?c))
    )
  )
)

; problem
(define (problem drone_problem_d1_r0_l5_p5_c5_g5_ct2)
(:domain emergency-logistics)
(:objects
	drone1 - drone
	arm1 - arm
	arm2 - arm
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	box1 - box
	box2 - box
	box3 - box
	box4 - box
	box5 - box
	food - content
	medicine - content
)
(:init
	(at-drone drone1 depot)
	(arm-of arm1 drone1)
	(arm-of arm2 drone1)
	(arm-free arm1)
	(arm-free arm2)
	(at-person person1 loc1)
	(at-person person2 loc2)
	(at-person person3 loc3)
	(at-person person4 loc4)
	(at-person person5 loc5)
	(at-box box1 depot)
	(box-has box1 food)
	(at-box box2 depot)
	(box-has box2 food)
	(at-box box3 depot)
	(box-has box3 food)
	(at-box box4 depot)
	(box-has box4 food)
	(at-box box5 depot)
	(box-has box5 medicine)
)
(:goal (and
	(at-drone drone1 depot)
	(person-has person1 food)
	(person-has person2 food)
	(person-has person3 food)
	(person-has person4 food)
	(person-has person4 medicine)
	))
)

; plan
1. (pick drone1 arm1 box1 depot)
   deleted: (arm-free arm1) (at-box box1 depot)
   added: (holding arm1 box1)
   goals met: 1 of 6
2. (pick drone1 arm2 box5 depot)
   deleted: (arm-free arm2) (at-box box5 depot)
   added: (holding arm2 box5)
   goals met: 1 of 6
3. (fly drone1 depot loc4)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc4)
   goals met: 0 of 6
4. (deliver drone1 arm2 box5 person4 loc4 medicine)
   deleted: (holding arm2 box5)
   added: (person-has person4 medicine) (at-box box5 loc4) (arm-free arm2)
   goals met: 1 of 6
5. (deliver drone1 arm1 box1 person4 loc4 food)
   deleted: (holding arm1 box1)
   added: (person-has person4 food) (at-box box1 loc4) (arm-free arm1)
   goals met: 2 of 6
6. (pick drone1 arm1 box1 loc4)
   deleted: (arm-free arm1) (at-box box1 loc4)
   added: (holding arm1 box1)
   goals met: 2 of 6
7. (fly drone1 loc4 loc1)
   deleted: (at-drone drone1 loc4)
   added: (at-drone drone1 loc1)
   goals met: 2 of 6
8. (deliver drone1 arm1 box1 person1 loc1 food)
   deleted: (holding arm1 box1)
   added: (person-has person1 food) (at-box box1 loc1) (arm-free arm1)
   goals met: 3 of 6
9. (pick drone1 arm1 box1 loc1)
   deleted: (arm-free arm1) (at-box box1 loc1)
   added: (holding arm1 box1)
   goals met: 3 of 6
10. (fly drone1 loc1 loc2)
   deleted: (at-drone drone1 loc1)
   added: (at-drone drone1 loc2)
   goals met: 3 of 6
11. (deliver drone1 arm1 box1 person2 loc2 food)
   deleted: (holding arm1 box1)
   added: (person-has person2 food) (at-box box1 loc2) (arm-free arm1)
   goals met: 4 of 6
12. (pick drone1 arm1 box1 loc2)
   deleted: (arm-free arm1) (at-box box1 loc2)
   added: (holding arm1 box1)
   goals met: 4 of 6
13. (fly drone1 loc2 loc3)
   deleted: (at-drone drone1 loc2)
   added: (at-drone drone1 loc3)
   goals met: 4 of 6
14. (deliver drone1 arm1 box1 person3 loc3 food)
   deleted: (holding arm1 box1)
   added: (person-has person3 food) (at-box box1 loc3) (arm-free arm1)
   goals met: 5 of 6
15. (fly drone1 loc3 depot)
   deleted: (at-drone drone1 loc3)
   added: (at-drone drone1 depot)
   goals met: 6 of 6
